//Завдання 1
//Використовуючи Visual Studio, створіть проєкт за шаблоном Windows Forms Application. Потрібно:

//Створити моделі сутностей, використовуючи техніку Database First. (Підключити існуючу базу даних з завдання 2 (4 уроку))--
//Реалізувати зручний інтерфейс та логіку для внесення категорій товару--
//Реалізувати зручний інтерфейс та логіку для внесення продукції-
//Реалізувати зручний інтерфейс та логіку для внесення ключових слів для товарів-
//Створити SQL команду для бекапу за вказаним вами шляхом--
//При внесенні даних у вашому магазині мають також додаватися та відновлюватися дані по товарам та категоріям--
//Завдання 2
//Відкрити рішення 1 (цього уроку)

//Реалізувати зручний інтерфейс та логіку для відновлення бази за обраним бекапом
//Вам повинен бути відображений список усіх бекапів, а ви обираєте який саме потрібно відновити
//Завдання 3 *
//Відкрити рішення 2(цього уроку)

//Реалізувати зручний інтерфейс та логіку для редагування та видалення категорій товару
//Реалізувати зручний інтерфейс та логіку для редагування та видалення продукції
//Реалізувати зручний інтерфейс та логіку для редагування та видалення ключових слів для товарів
namespace EntityFrameworkL5
{
    internal static class Program
    {
        /// <summary>
        ///  The main entry point for the application.
        /// </summary>
        [STAThread]
        static void Main()
        {
            // To customize application configuration such as set high DPI settings or default font,
            // see https://aka.ms/applicationconfiguration.
            ApplicationConfiguration.Initialize();
            Application.Run(new Form1());
        }
    }
}